Revit 2027 API
LoadBase.RemoveHostConstraint Method
 Removes constraint from host for this load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveHostConstraint()
Public Sub RemoveHostConstraint
public:
void RemoveHostConstraint()
member RemoveHostConstraint : unit -> unit
Exceptions
Exception | Condition
ModificationForbiddenException |  the Load is an AreaLoad and the host is an Analytical Panel with curved profile.
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace